# ActsAsEmotionText

module Emotion

	Symbols = [ '[惊吓]', '[晕]', '[流鼻涕]', '[挖鼻子]', '[鼓掌]', '[骷髅]', '[坏笑]', '[傲慢]', '[大哭]', '[砸头]', '[衰]', '[哭]', '[可爱]', '[冷汗]', '[抽烟]', '[擦汗]', '[亲亲]', '[糗]', '[吃惊]', '[左哼哼]', '[疑问]', '[惊恐]', '[睡觉]', '[皱眉头]', '[可怜]', '[打呵欠]', '[害羞]', '[花痴]', '[右哼哼]', '[囧]', '[大便]', '[咒骂]', '[贼笑]', '[嘘]', '[吐]', '[苦恼]', '[白眼]', '[流汗]', '[大笑]', '[羞]', '[撇嘴]', '[偷笑]', '[BS]', '[困]', '[火]', '[闭嘴]', '[抓狂]', '[强]', '[不行]', '[装酷]' ]
	Re = /\[((惊吓)|(晕)|(流鼻涕)|(挖鼻子)|(鼓掌)|(骷髅)|(坏笑)|(傲慢)|(大哭)|(砸头)|(衰)|(哭)|(可爱)|(冷汗)|(抽烟)|(擦汗)|(亲亲)|(糗)|(吃惊)|(左哼哼)|(疑问)|(惊恐)|(睡觉)|(皱眉头)|(可怜)|(打呵欠)|(害羞)|(花痴)|(右哼哼)|(囧)|(大便)|(咒骂)|(贼笑)|(嘘)|(吐)|(苦恼)|(白眼)|(流汗)|(大笑)|(羞)|(撇嘴)|(偷笑)|(BS)|(困)|(火)|(闭嘴)|(抓狂)|(强)|(不行)|(装酷))\]/

  def acts_as_emotion_text(options={})
    define_method("before_create") do
      puts "convert_emotion"
      options[:columns].each do |column|
        eval("self.#{column}").gsub!(Re, "<img src='/images/faces/\\1.gif'/>")
        puts "self.#{column} = #{eval("self.#{column}")}"
      end
    end
  end

end

ActiveRecord::Base.extend(Emotion)
